{
    "data_paths": "$DATA_PATHS",
    "output_dir": "$OUTPUT_DIR",
    "tb_dir": "$TensorBoard_DIR",
    "pretrained_model_path": "$MODEL_NAME_OR_PATH",
    "model_type": "$MODEL_TYPE",
    "load_raw_dataset": true,
    "data_split": "98,2,0",
    "padding_mode": "padding",
    "use_dynamic_padding": true,
    "tokenize_mode": "sft",
    "tokenizer_type": "AutoTokenizer",
    "weighted_loss_mode": "case3",
    "attn_implementation": "flash_attention_2",
    "seq_length": 4096,
    "seed": 1234,
    "peft_type": null,
    "per_device_train_batch_size": 2,
    "per_device_eval_batch_size": 2,
    "learning_rate": 5e-5,
    "min_lr": 5e-6,
    "weight_decay": 0.1,
    "gradient_accumulation_steps": 1,
    "lr_scheduler_type": "cosine",
    "num_warmup_steps": 300,
    "num_train_epochs": 4,
    "resume_from_checkpoint": null,
    "log_interval": 10,
    "checkpointing_steps": 100,
    "evaluation_steps": 100,
    "max_train_steps": null,
    "epoch_checkpointing": true,
    "shuffle_before_split": true,
    "early_stopping": true,
    "early_stopping_stall_num": 5,
    "saving_limit": 3
}