{
    "load_raw_dataset": true,
    "data_paths": "$DATA_PATHS",
    "output_dir": "$OUTPUT_DIR",
    "tb_dir": "$TensorBoard_DIR",
    "pretrained_model_path": "$MODEL_NAME_OR_PATH",
    "vocab_file": "$MODEL_NAME_OR_PATH",
    "low_cpu_mem_usage": true,
    "data_split": "95,5,0",
    "padding_mode": "padding",
    "tokenize_mode": "sft",
    "weighted_loss_mode": "case3",
    "shuffle_before_split": true,
    "use_random_sampler": true,
    "early_stopping": true,
    "early_stopping_stall_num": 5,
    "weight_by_num_documents": true,
    "make_vocab_size_divisible_by": 128,
    "model_parallel_size": 1,
    "model_type": "qwen",
    "peft_type": "lora",
    "lora_rank": 32,
    "lora_alpha": 32,
    "lora_dropout": 0.05,
    "quantization": "16bit",
    "tokenizer_type": "AutoTokenizer",
    "use_slow_tokenizer": false,
    "use_xformers": true,
    "trust_remote_code": true,
    "use_dynamic_padding": true,
    "per_device_train_batch_size": 4,
    "per_device_eval_batch_size": 4,
    "world_size": 128,
    "learning_rate": 1e-4,
    "min_lr": 1e-5,
    "weight_decay": 0.1,
    "gradient_accumulation_steps": 1,
    "lr_scheduler_type": "cosine",
    "num_warmup_steps": 1000,
    "num_train_epochs": 4,
    "seed": 1234,
    "seq_length": 2048,
    "preprocessing_num_workers": 2,
    "num_workers": 2,
    "resume_from_checkpoint": null,
    "log_interval": 10,
    "checkpointing_steps": 1000,
    "evalation_steps": 1000,
    "max_train_steps": null,
    "epoch_checkpointing": false,
    "checkpoint_activations": true
}