{
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "bos_token_id": 100256,
  "eos_token_id": 100256,
  "hidden_act": "gelu",
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 4096,
  "model_type": "gpt_neox",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "rotary_emb_base": 10000,
  "rotary_pct": 1.0,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.26.1",
  "use_cache": true,
  "use_parallel_residual": true,
  "vocab_size": 100864
}
