{
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "attention_probs_dropout_prob": 0,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "hidden_act": "gelu_fast",
  "hidden_dropout_prob": 0,
  "hidden_size": 768,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 2048,
  "model_type": "gpt_neox",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "rotary_emb_base": 10000,
  "rotary_pct": 0.25,
  "tie_word_embeddings": false,
  "transformers_version": "4.28.1",
  "use_cache": false,
  "vocab_size": 50432
}
